#define  _CRT_SECURE_NO_WARNINGS 1


//char 1个字节
//short 2个字节
//int 3byte
//long 4/8 长整型
//long 8	更长的整型
//float
//double

//字符存储的时候是ascII是整型，所以是整型家族


//构造类型：struct
//指针类型
//空类型： void

#include <limits.h>


//int main() {
//
//	//INT_MAX;
//
//	int num1 = 10;///创建一个整型变量，叫num，这时num向内存申请了4个字节
//	//4个字节，32比特位
//	//00000000000000000000000000001010 - 原码
//	//00000000000000000000000000001010 - 反码
//	//00000000000000000000000000001010 - 补码
//
//	int num2 = - 10;
//	//10000000000000000000000000001010 - 原码
//	//11111111111111111111111111110101 - 反码
//	//11111111111111111111111111110110 - 补码
//
//	return 0;
//}
//整型数据的二进制有三种表示方式： 原码、反码、补码

//cpu没有加法器
//计算1-1
//1+（-1）
	//000000000000000000000000000000001
	//111111111111111111111111111111111
	//000000000000000000000000000000000 -->0
// 原码计算
	//000000000000000000000000000000001
	//100000000000000000000000000000001
	//100000000000000000000000000000010 -->-2

//内存的存储是倒着存储的
//大端字节序存储

//1.字节序是以字节为单位讨论存储顺序
//2.小端字节存储：把一个数据的低位字节的内容存放在低地址处，把高位字节的内容放在高地址处
//2.大端字节存储：把一个数据的低位字节的内容存放在高地址处，把高位字节的内容放在低地址处


//int main() {
//	int a = 0x11223344;
//	return 0;
//}
//

//对于整型家族来说有：有符号和无符号的区分
//在vx上char是signed char





////如何判断大小端
//#include <stdio.h>
//
////小端返回1
////大端返回0
//int check_sys( ) {
//	int a = 1;
//	return *(char*)&a;
//}
//
//
//int main() {
//	int ret = check_sys();
//	if(ret ==1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//
//	int a = 1;
//	//char* p = (char*)&a;
//	if (*(char *)&a == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//
//
//
//	return 0;
//}


//#include <stdio.h>
//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111-截断
//	//11111111 -a
//	//输出以后要进行整型提升
//	//11111111111111111111111111111111
//	//11111111111111111111111111111110
//	//10000000000000000000000000000001--> -1
//
//	signed char b = -1;
//	//11111111111111111111111111111111
//	//11111111 -b
//	//11111111111111111111111111111111
//	unsigned char c = -1;
//	//11111111 -c
//	// 整型提升
//	//00000000000000000000000011111111
//	//
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	//%d - 十进制的形式打印有符号整型整数
//	//整型提升
//
//	return 0;
//}
//

//#include <stdio.h>
//
//int main() {
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111110111111
//	//11111111111111111111111111000000
//	//10000000
//	//11111111111111111111111111000000
//	printf("%u\n", a);
//	//11111111111111111111111111000000 =>4294967168
//	return 0;
//
//}

#include <stdio.h>
//
//int main() {
//
//	int i = - 20;
//	//10000000000000000000000000010100
//	//11111111111111111111111111101011
//	//11111111111111111111111111101100
//	unsigned int j = 10;
//	//00000000000000000000000000001010
//	//11111111111111111111111111101100
//	//11111111111111111111111111110110
//	//11111111111111111111111111110101
//	//10000000000000000000000000001010
//	printf("%d\n", i + j);
//
//	return 0;
//}

#include <windows.h>
//int main() {
//
//	unsigned int i;
//	for (i = 9; i >= 0; i--) {
//
//		printf("%u\n", i);
//		Sleep(1000);
//	}
//
//	return 0;
//}

#include <string.h>

//int main() {
//
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++) {
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));//strlen是统计\0之前出现的字符的个数，操好牛
//	return 0;
//}



int main() {

	int n = 9;
	//0 00000000 00000000001001
	//S E        M
	//0 -126     0.000000001001
	//(-1)^0 * 0.00000001001 * 2^-126
	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);
	printf("*pFloat的值为: %f\n", *pFloat);
	*pFloat = 9.0;
	//1001.0
	//1.001*2^3
	//(-1)^0*1.001*2^3
	//s= 0 E =3 M = 1.001
	//0 10000010 00100000000000000000000
	//
	printf("n的值为：%d\n", n);//1091567616
	printf("*pFloat的值为: %f\n", *pFloat);

	return 0;
}

//
//int main() {
//
//	float f = 5.5;
//	//101.1
//	//1.011*2^2
//	//(-1)^0 *1.001 *2^2
//	//S = 0
//	//M = 1.011
//	//E = 2
//	//0 10000001 01100000000000000
//	//0x40b0000
//}

//写一段浮点的存储的博客